"""
Пользователь вводит строку из нескольких слов, разделённых пробелами.
Вывести каждое слово с новой строки. Строки необходимо пронумеровать.
Если в слово длинное, выводить только первые 10 букв в слове.
"""
user_input = list(input('Вводите строку из нескольких слов, разделённых пробелами> ').split())
for v in range(len(user_input)):
    if len(user_input[v]) > 10:
        print(f'{v + 1}. {user_input[v][:10]}')
    else:
        print(f'{v + 1}. {user_input[v]}')
